/*Тема работы: Пространства имен.

4. Человек, ВУЗ, специальность, курс, куратор, группа, студент.

Для полученного списка классов требуется сформировать диаграмму классов, используя принципы наследования, композиции и агрегации.

Создать проект консольной программы.

Создать собственное пространство имен, в которое будут помещены все создаваемые пользовательские классы.

Реализовать классы, согласно диаграмме классов, причем:
-- во всех классах должны быть свои данные в виде 1-2 переменных, представляющие характеристики объектов и
расположенные в private или protected секциях;
-- во всех классах создать конструктор по умолчанию и конструктор инициализации (не забыть про передачу
параметров в конструкции базовых классов);
-- во всех классах создать деструктор;
-- во всех классах создать метод просмотра содержимого;
-- остальные методы создавать по необходимости.

Описание каждого класса требуется реализовать в отдельной паре файлов (.h и .cpp).

В головной функции создать объект класса, расположенного последним в списке, выполнить доступ к его методам и методам его составных частей.

Рассмотреть вызовы конструкторов и деструкторов при создании и разрушении объектов.
Рассмотреть различные виды организации доступа к элементам собственного пространства имен и пространства имен std.*/
